alter table major_info add `is_hot` tinyint(1) default 0 comment '是否热门领域专业分类(0否1是)' after `state`;

/*战略性新兴产业分类

一：新一代信息技术产业
   1下一代信息网络产业
   2电子核心产业
   3新兴软件和新型信息技术服务
   4互联网与云计算大数据服务
   5人工智能
二：高端装备制造产业
   1智能制造装备产业
   2航空装备产业
   3卫星及应用产业
   4轨道交通装备产业
   5海洋工程装备产业
三:新材料产业
   1先进钢铁材料
   2先进有色金属材料
   3先进石化化工新材料
   4先进无机非金属材料
   5高性能纤维及制品和复合材料
   6前沿新材料
   7新材料相关服务
四:生物产业
   1生物医药产业
   2生物医学工程产业
   3生物农业及相关产业
   4生物质能产业
   5其他生物业
五:新能源汽车产业
   1新能源汽车整车制造
   2新能源汽车装置、配件制造
   3新能源汽车相关设施制造
   4新能源汽车相关服务
六:新能源产业
   1核电产业
   2风能产业
   3太阳能产业
   4生物质能及其他新能源产业
   5智能电网产业
七:通航产业
   1运营服务
   2机场及航空港建设
   3通用飞机制造
八:节能环保产业
   1高效节能产业
   2先进环保产业
   3资源循环利用产业
九:数字创意产业
   1数字创意技术设备制造
   2数字文化创意活动
   3设计服务
   4数字创意与融合服务
十:相关服务业
   1新技术与创新创业服务
   2其他相关服务

十一:其他


大分类及其子类
农林牧渔    => 生物产业
环境科学    => 节能环保产业
化学化工    =>  新材料产业
轻纺科学    =>  新材料产业
生物科学    =>  生物产业
医药卫生    =>  生物产业
能源动力    =>  新能源产业
石油天然气  =>  新材料产业
原子能     => 新能源产业
矿业工程   =>  新材料产业
冶金工程   => 新产料产业
金属工艺   => 新材料产业
建筑科学   => 新材料产业
水利工程   => 新能源产业
电工技术   => 高端装备制造产业
自动化     => 高端装备制造产业
工程基础   => 其他
综合运输   => 通航产业
铁路运输   => 通航产业
公路运输   => 通航产业
水路运输   => 通航产业
航空航天    => 高端装备制造产业
机械仪表    => 高端装备制造产业
电子通信    => 高端装备制造产业
数理化学    => 新一代信息技术产业
天文地球    => 相关服务业
经济金融    => 新一代信息技术产业
文体科教    => 相关服务业
 */

 insert into major_info(`mtype`,`mcode`,`pmcode`,`mname`,`mabbr`,`mlevel`,`state`,`is_hot`,`creater`,`insert_time`)
       values(2,'L1_0001','-1','新一代信息技术产业','新一代信息技术产业',1,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0001_000100','L1_0001','下一代信息网络产业','下一代信息网络产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0001_000200','L1_0001','电子核心产业','电子核心产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0001_000300','L1_0001','新兴软件和新型信息技术服务','新兴软件和新型信息技术服务',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0001_000400','L1_0001','互联网与云计算大数据服务','互联网与云计算大数据服务',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0001_000500','L1_0001','人工智能','人工智能',2,1,1,'root','2019-07-01 14:30:00'),

       (2,'L1_0002','-1','高端装备制造产业','高端装备制造产业',1,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0002_000100','L1_0002','智能制造装备产业','智能制造装备产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0002_000200','L1_0002','航空装备产业','航空装备产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0002_000300','L1_0002','卫星及应用产业','卫星及应用产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0002_000400','L1_0002','轨道交通装备产业','轨道交通装备产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0002_000500','L1_0002','海洋工程装备产业','海洋工程装备产业',2,1,1,'root','2019-07-01 14:30:00'),

       (2,'L1_0003','-1','新材料产业','新材料产业',1,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0003_000100','L1_0003','先进钢铁材料','先进钢铁材料',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0003_000200','L1_0003','先进有色金属材料','先进有色金属材料',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0003_000300','L1_0003','先进石化化工新材料','先进石化化工新材料',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0003_000400','L1_0003','先进无机非金属材料','先进无机非金属材料',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0003_000500','L1_0003','高性能纤维及制品和复合材料','高性能纤维及制品和复合材料',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0003_000600','L1_0003','前沿新材料','前沿新材料',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0003_000700','L1_0003','新材料相关服务','新材料相关服务',2,1,0,'root','2019-07-01 14:30:00'),

       (2,'L1_0004','-1','生物产业','生物产业',1,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0004_000100','L1_0004','生物医药产业','生物医药产业',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0004_000200','L1_0004','生物医学工程产业','生物医学工程产业',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0004_000300','L1_0004','生物农业及相关产业','生物农业及相关产业',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0004_000400','L1_0004','生物质能产业','生物质能产业',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0004_000500','L1_0004','其他生物业','其他生物业',2,1,0,'root','2019-07-01 14:30:00'),

       (2,'L1_0005','-1','新能源汽车产业','新能源汽车产业',1,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0005_000100','L1_0005','新能源汽车整车制造','新能源汽车整车制造',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0005_000200','L1_0005','新能源汽车装置、配件制造','新能源汽车装置、配件制造',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0005_000300','L1_0005','新能源汽车相关设施制造','新能源汽车相关设施制造',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0005_000400','L1_0005','新能源汽车相关服务','新能源汽车相关服务',2,1,0,'root','2019-07-01 14:30:00'),

       (2,'L1_0006','-1','新能源产业','新能源产业',1,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0006_000100','L1_0006','核电产业','核电产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0006_000200','L1_0006','风能产业','风能产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0006_000300','L1_0006','太阳能产业','太阳能产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0006_000400','L1_0006','生物质能及其他新能源产业','生物质能及其他新能源产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0006_000500','L1_0006','智能电网产业','智能电网产业',2,1,1,'root','2019-07-01 14:30:00'),


       (2,'L1_0007','-1','通航产业','通航产业',1,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0007_000100','L1_0007','运营服务','运营服务',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0007_000200','L1_0007','机场及航空港建设','机场及航空港建设',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0007_000300','L1_0007','通用飞机制造','通用飞机制造',2,1,0,'root','2019-07-01 14:30:00'),

       (2,'L1_0008','-1','节能环保产业','节能环保产业',1,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0008_000100','L1_0008','高效节能产业','高效节能产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0008_000200','L1_0008','先进环保产业','先进环保产业',2,1,1,'root','2019-07-01 14:30:00'),
       (2,'L1_0008_000300','L1_0008','资源循环利用产业','资源循环利用产业',2,1,1,'root','2019-07-01 14:30:00'),

       (2,'L1_0009','-1','数字创意产业','数字创意产业',1,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0009_000100','L1_0009','数字创意技术设备制造','数字创意技术设备制造',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0009_000200','L1_0009','数字文化创意活动','数字文化创意活动',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0009_000300','L1_0009','设计服务','设计服务',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0009_000400','L1_0009','数字创意与融合服务','数字创意与融合服务',2,1,0,'root','2019-07-01 14:30:00'),

       (2,'L1_0010','-1','相关服务业','相关服务业',1,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0010_000100','L1_0010','新技术与创新创业服务','新技术与创新创业服务',2,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0010_000200','L1_0010','其他相关服务','其他相关服务',2,1,0,'root','2019-07-01 14:30:00'),

       (2,'L1_0011','-1','其他','其他',1,1,0,'root','2019-07-01 14:30:00'),
       (2,'L1_0011_000100','L1_0011','其他','其他',2,1,0,'root','2019-07-01 14:30:00');


/*
批量更新major_userinfo 关系表 成果,需求,征询关系均存在此表中
 */
/*农林牧渔 =>  生物农业及相关产业*/
update major_userinfo set mcode='L1_0004_000300' where mcode in(
    select mcode from major_info where ((mcode = 'L1_0001') or (pmcode = 'L1_0001')
));
/*生物科学 =>  其他生物业*/
update major_userinfo set mcode='L1_0004_000500' where mcode in(
    select mcode from major_info where ((mcode = 'L1_0041') or (pmcode = 'L1_0041')
));
/*医药卫生 =>  生物医药产业*/
update major_userinfo set mcode='L1_0004_000100' where mcode in(
    select mcode from major_info where ((mcode = 'L1_0051') or (pmcode ='L1_0051')
));
/*环境科学    => 先进环保产业*/
update major_userinfo set mcode='L1_0008_000200' where mcode in(
    select mcode from major_info where ((mcode = 'L1_0021') or (pmcode ='L1_0021')
));
/*化学化工,轻纺科学,石油天然气,矿业工程,冶金工程,金属工艺,建筑科学   =>  新材料产业*/
/*化学化工,石油天然气,矿业工程,冶金工程 => 先进石化化工新材料 */
update major_userinfo set mcode='L1_0003_000300' where mcode in(
         select mcode from major_info where ((mcode in('L1_0011','L1_0071','L1_0091','L1_0101')) or (pmcode in('L1_0011','L1_0071','L1_0091','L1_0101'))
));
/*轻纺科学 => 高性能纤维及制品和复合材料 */
update major_userinfo set mcode='L1_0003_000500' where mcode in(
         select mcode from major_info where ((mcode = 'L1_0031') or (pmcode ='L1_0031')
));
/*金属工艺 => 先进有色金属材料 */
update major_userinfo set mcode='L1_0003_000200' where mcode in(
         select mcode from major_info where ((mcode = 'L1_0111') or (pmcode ='L1_0111')
));
/*建筑科学 => 先进钢铁材料 */
update major_userinfo set mcode='L1_0003_000100' where mcode in(
         select mcode from major_info where ((mcode = 'L1_0121') or (pmcode ='L1_0121')
));

/*能源动力,原子能,水利工程   =>  新能源产业 */
/*能源动力,原子能 => 核电产业*/
update major_userinfo set mcode='L1_0006_000100' where mcode in(
         select mcode from major_info where ((mcode in('L1_0061','L1_0081')) or (pmcode in ('L1_0061','L1_0081'))
         ));
/*水利工程 => 生物质能及其他新能源产业*/
update major_userinfo set mcode='L1_0006_000400' where mcode in(
         select mcode from major_info where ((mcode = 'L1_0131') or (pmcode ='L1_0131')
));
/*电工技术,自动化,航空航天,机械仪表,电子通信   => 智能制造装备产业 */
update major_userinfo set mcode='L1_0002_000100' where mcode in(
         select mcode from major_info where ((mcode in('L1_0141','L1_0151','L1_0211','L1_0221','L1_0231'))
         or
         (pmcode in ('L1_0141','L1_0151','L1_0211','L1_0221','L1_0231'))
         ));
/*综合运输,铁路运输,公路运输,水路运输   => 运营服务 */
update major_userinfo set mcode='L1_0007_000100' where mcode in(
         select mcode from major_info where ((mcode in('L1_0171','L1_0181','L1_0191','L1_0201'))
         or
         (pmcode in ('L1_0171','L1_0181','L1_0191','L1_0201'))
         ));
/*数理化学,经济金融    => 新一代信息技术产业 */
update major_userinfo set mcode='L1_0001' where mcode in(
         select mcode from major_info where ((mcode in('L1_0241','L1_0261'))
         or
         (pmcode in ('L1_0241','L1_0261'))
         ));
/*数理化学,经济金融,天文地球,文体科教    => 下一代信息网络产业 */
update major_userinfo set mcode='L1_0001_000100' where mcode in(
         select mcode from major_info where ((mcode in('L1_0241','L1_0261','L1_0251','L1_0271'))
         or
         (pmcode in ('L1_0241','L1_0261','L1_0251','L1_0271'))
         ));
/*工程基础   => 其他 */

update major_userinfo set mcode='L1_0011_000100' where mcode in(
         select mcode from major_info where ((mcode in('L1_0161'))
         or
         (pmcode in ('L1_0161'))
         ));

/*农林牧渔,生物科学,医药卫生 => 生物产业
update major_userinfo set mcode='L1_0004' where mcode in(
         select mcode from major_info where ((mcode in('L1_0001','L1_0041','L1_0051')) or (pmcode in ('L1_0001','L1_0041','L1_0051'))
         ));
*/

/*环境科学    => 节能环保产业
update major_userinfo set mcode='L1_0008' where mcode in(
         select mcode from major_info where ((mcode in('L1_0021')) or (pmcode in ('L1_0021'))
         ));
*/

/*化学化工,轻纺科学,石油天然气,矿业工程,冶金工程,金属工艺,建筑科学   =>  新材料产业
update major_userinfo set mcode='L1_0003' where mcode in(
         select mcode from major_info where ((mcode in('L1_0011','L1_0031','L1_0071','L1_0091','L1_0101','L1_0111','L1_0121'))
         or
         (pmcode in ('L1_0011','L1_0031','L1_0071','L1_0091','L1_0101','L1_0111','L1_0121'))
         ));
*/

/*能源动力,原子能,水利工程   =>  新能源产业
update major_userinfo set mcode='L1_0006' where mcode in(
         select mcode from major_info where ((mcode in('L1_0061','L1_0081','L1_0131')) or (pmcode in ('L1_0061','L1_0081','L1_0131'))
         ));
*/

/*电工技术,自动化,航空航天,机械仪表,电子通信   => 高端装备制造产业
update major_userinfo set mcode='L1_0002' where mcode in(
         select mcode from major_info where ((mcode in('L1_0141','L1_0151','L1_0211','L1_0221','L1_0231'))
         or
         (pmcode in ('L1_0141','L1_0151','L1_0211','L1_0221','L1_0231'))
         ));
*/
/*综合运输,铁路运输,公路运输,水路运输   => 通航产业
update major_userinfo set mcode='L1_0007' where mcode in(
         select mcode from major_info where ((mcode in('L1_0171','L1_0181','L1_0191','L1_0201'))
         or
         (pmcode in ('L1_0171','L1_0181','L1_0191','L1_0201'))
         ));
 */

/*数理化学,经济金融,天文地球,文体科教    => 新一代信息技术产业
update major_userinfo set mcode='L1_0001' where mcode in(
         select mcode from major_info where ((mcode in('L1_0241','L1_0261','L1_0251','L1_0271'))
         or
         (pmcode in ('L1_0241','L1_0261','L1_0251','L1_0271'))
         ));
*/
/*工程基础   => 其他

update major_userinfo set mcode='L1_0011' where mcode in(
         select mcode from major_info where ((mcode in('L1_0161'))
         or
         (pmcode in ('L1_0161'))
         ));
*/